// benefits aria

import { Accordion, AccordionItem } from "@szhsin/react-accordion";
import css from "./Benefits.module.css";
// import svg_ok from "../../assets/ok.svg";

const benefits = [
  {
    title: "Максимально висока ціна",
    describe:
      "Ми прагнемо запропонувати Вам максимально вигідну ціну за ваш автомобіль, адже наша мета — забезпечити найкращі умови для клієнтів. Наша бізнес-модель базується на великій кількості викуплених авто, що дозволяє нам пропонувати конкурентоспроможні ціни без шкоди для якості обслуговування",
  },
  // {
  //   title: "Викуп авто будь-яких марок",
  //   describe:
  //     "Наша компанія спеціалізується на викупі автомобілів усіх можливих марок і моделей, незалежно від їхнього походження чи року випуску. Ми готові розглянути будь-який транспортний засіб, щоб ви могли швидко та зручно продати своє авто без зайвих турбот",
  // },
  {
    title: "Розрахунок готівкою або на карту",
    describe:
      "Ми гарантуємо, що ви отримаєте повну суму за ваш автомобіль готівкою чи на карту прямо в день звернення. Жодних затримок чи розстрочок — усі фінансові операції проводяться швидко, зручно та прозоро",
  },
  {
    title: "Швидке оформлення",
    describe:
      "Процес оформлення всіх необхідних документів для викупу вашого автомобіля займає трохи більше однієї години. Ми цінуємо ваш час і робимо все можливе, щоб процедура була максимально швидкою та ефективною",
  },
  {
    title: "Юридична прозорість",
    describe:
      "Ми забезпечуємо повну юридичну чистоту угоди, що дозволяє Вам уникнути будь-яких ризиків втрати коштів чи шахрайства. Наші фахівці ретельно перевіряють усі документи, щоб гарантувати вашу безпеку",
  },
  {
    title: "Виїзд експерта до клієнта",
    describe:
      "Вам не доведеться витрачати час на поїздки — наш експерт приїде до Вас у зручне місце та час. Ми пропонуємо максимальну зручність, щоб процес оцінки та викупу авто був комфортним для Вас",
  },
  {
    title: "Викуп день у день",
    describe:
      "Ми гарантуємо, що Ви отримаєте гроші за свій автомобіль у день звернення до нас. Наша оперативність дозволяє завершити угоду швидко, щоб Ви могли одразу розпоряджатися отриманими коштами",
  },
  {
    title: "Швидка оцінка авто",
    describe:
      "Вам не потрібно відвідувати СТО чи проводити додаткові перевірки — ми оцінимо ваш автомобіль прямо на місці абсолютно безкоштовно. Наші експерти швидко та професійно визначать стан вашого авто",
  },
  {
    title: "Викуп авто в будь-якому стані",
    describe:
      "Ми готові викупити ваш автомобіль незалежно від його технічного стану, зовнішнього вигляду чи рівня зношеності. Навіть якщо ваше авто потребує ремонту, ми запропонуємо Вам вигідну ціну",
  },
  {
    title: "Безкоштовна консультація",
    describe:
      "Наші кваліфіковані фахівці надають безкоштовні професійні консультації щодо вартості вашого автомобіля та умов викупу. Ми завжди готові відповісти на всі ваші запитання, щоб Ви почувалися впевнено",
  },
  {
    title: "Економія вашого часу",
    describe:
      "Ми беремо на себе всі клопоти, пов’язані з продажем автомобіля, щоб Ви могли зосередитися на своїх особистих справах. Наша команда зробить процес максимально швидким і безтурботним для Вас",
  },
  // {
  //   title: "Прозора оцінка вартості",
  //   describe:
  //     "Наші експерти надають детальне пояснення, як саме формується ціна вашого автомобіля, враховуючи його стан, ринкові тенденції та інші фактори. Ми гарантуємо чесність і прозорість на кожному етапі",
  // },
  // {
  //   title: "Відсутність прихованих платежів",
  //   describe:
  //     "Ви не сплачуєте жодних додаткових комісій чи зборів за наші послуги — усі витрати ми беремо на себе. Це дозволяє Вам отримати максимальну вигоду від продажу вашого автомобіля",
  // },
  // {
  //   title: "Викуп авто після ДТП",
  //   describe:
  //     "Ми готові викупити ваш автомобіль навіть після серйозних аварій чи значних пошкоджень. Незалежно від стану, ми запропонуємо справедливу ціну та візьмемо на себе всі турботи",
  // },
  // {
  //   title: "Цілодобова підтримка",
  //   describe:
  //     "Наша команда працює цілодобово, щоб Ви могли отримати консультацію чи організувати викуп у будь-який зручний для Вас час. Ми завжди на зв’язку, щоб допомогти Вам із будь-якими питаннями",
  // },
  // {
  //   title: "Гнучкий графік роботи",
  //   describe:
  //     "Ми адаптуємося до вашого розкладу, працюючи у зручний для вас час, включаючи вихідні та святкові дні. Ви можете обрати будь-який момент для оцінки чи викупу вашого автомобіля",
  // },
  // {
  //   title: "Допомога з переоформленням",
  //   describe:
  //     "Ми беремо на себе всі формальності, пов’язані з переоформленням документів у державних органах, щоб Ви не витрачали свій час і зусилля. Усе буде зроблено швидко, професійно та без зайвих клопотів",
  // },
];

export default function Benefits() {
  return (
    <section aria-labelledby="benefits-title" className={css.benefits}>
      <h1 id="benefits-title" className={css.benefits_title}>
        ЧОМУ ПОНАД 1000+ КЛІЄНТІВ ВИБРАЛИ AUTOTRADEKH?
      </h1>
      {benefits.length > 0 && (
        <Accordion transition transitionTimeout={250}>
          <ul className={css.benefits_list} role="list">
            {benefits.map((benefit, index) => (
              <li key={index} className={css.benefit_item} role="listitem">
                <AccordionItem
                  header={
                    <div className={css.benefit_title}>
                      <svg
                        className={css.ok_icon}
                        aria-hidden
                        viewBox="0 0 24 24"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                      >
                        <path
                          fill="var(--blue-soft)"
                          d="M21 11.08V12c-.001 2.485-1.009 4.733-2.64 6.362s-3.88 2.634-6.365 2.632-4.734-1.009-6.362-2.64S2.999 14.475 3 11.989s1.009-4.733 2.64-6.362 3.88-2.634 6.365-2.633a8.844 8.844 0 0 1 3.649.775 1 1 0 1 0 .831-1.819 10.85 10.85 0 0 0-4.479-.956C8.969.992 6.217 2.223 4.226 4.211S1.002 8.951 1 11.988s1.229 5.789 3.217 7.78 4.739 3.225 7.776 3.226 5.789-1.229 7.78-3.217S22.998 15.038 23 12v-.92a1 1 0 0 0-2 0zm.293-7.787L12 12.595l-2.293-2.292a.999.999 0 1 0-1.414 1.414l3 3c.391.391 1.024.39 1.415 0l10-10.01a1 1 0 1 0-1.415-1.413z"
                        />
                      </svg>

                      {/* <img src={svg_ok} className={css.ok_icon} alt="Іконка ok" aria-hidden /> */}

                      <h2 className={css.main}>{benefit.title}</h2>
                    </div>
                  }
                >
                  <p
                    className={css.describe}
                    id={`benefit-panel-${index}`}
                    aria-labelledby={`benefit-title-${index}`}
                    role="region"
                  >
                    {benefit.describe}
                  </p>
                </AccordionItem>
              </li>
            ))}
          </ul>
        </Accordion>
      )}
    </section>
  );
}
